app/Views/admin/stok_opname_view.php

<?php
    // Tambahkan ini di bagian paling atas file view
    $db = \Config\Database::connect();
    $cek_opname = $db->table('sistem_kontrol')
                     ->where('nama_fitur', 'stok_opname_hold')
                     ->get()->getRow();
---
SELECT *
FROM `sistem_kontrol`
WHERE `nama_fitur` = 'stok_opname_hold'