app/Common.php

SELECT *
FROM `pengaturan_akses`
WHERE `role` = 'kasir'
AND `modul` = 'dashboard'
AND `status` = 1
---
    function cek_akses($role, $modul)
    {
        $db = \Config\Database::connect();
        $akses = $db->table('pengaturan_akses')
                    ->where('role', $role)
                    ->where('modul', $modul)
                    ->where('status', 1)
                    ->get()
                    ->getRow();