app/Controllers/Admin.php

SELECT SUM(`total_bayar`) AS `total`
FROM `transaksi`
WHERE DATE(created_at) = '2026-06-18'
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE DATE(created_at) = '2026-06-18'
---
        $data['chart_data']   = json_encode($totals);

        // 2. Ambil data statistik dasar Harian
        $pendapatanHariIni = $db->table('transaksi')
            ->selectSum('total_bayar', 'total')
            ->where('DATE(created_at)', $hariIni)
            ->get()
            ->getRow()->total ?? 0;

        $jumlahTransaksiHariIni = $db->table('transaksi')
            ->where('DATE(created_at)', $hariIni)
            ->countAllResults();

SELECT SUM(`qty`) AS `qty`
FROM `transaksi_detail` `td`
JOIN `transaksi` `t` ON `t`.`id` = `td`.`transaksi_id`
WHERE DATE(t.created_at) = '2026-06-18'
SELECT SUM(`total_bayar`) AS `total`
FROM `transaksi`
WHERE DATE(created_at) = '2026-06-17'
---
        $data['total_pendapatan'] = $pendapatanHariIni;
        $data['jumlah_transaksi'] = $jumlahTransaksiHariIni;
        $data['rata_rata'] = ($jumlahTransaksiHariIni > 0) ? ($pendapatanHariIni / $jumlahTransaksiHariIni) : 0;
        $data['item_terjual'] = $db->table('transaksi_detail td')
            ->join('transaksi t', 't.id = td.transaksi_id')
            ->where('DATE(t.created_at)', $hariIni)
            ->selectSum('qty')
            ->get()->getRow()->qty ?? 0;

        // 3. Persentase Pendapatan Harian
        $kemarin = date('Y-m-d', strtotime('-1 days'));
        $pendapatanKemarin = $db->table('transaksi')
            ->selectSum('total_bayar', 'total')
            ->where('DATE(created_at)', $kemarin)
            ->get()
            ->getRow()->total ?? 0;

SELECT SUM(`total_bayar`) AS `total`
FROM `transaksi`
WHERE DATE(created_at) >= '2026-06-12'
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE DATE(created_at) >= '2026-06-12'
---
        // 4. Akumulasi Mingguan
        $today        = date('Y-m-d');
        $sevenDaysAgo = date('Y-m-d', strtotime('-6 days'));
        $data['total_pendapatan_mingguan'] = $db->table('transaksi')
            ->selectSum('total_bayar', 'total')
            ->where('DATE(created_at) >=', $sevenDaysAgo)
            ->get()->getRow()->total ?? 0;

        $data['jumlah_transaksi_mingguan'] = $db->table('transaksi')
            ->where('DATE(created_at) >=', $sevenDaysAgo)
            ->countAllResults();

SELECT SUM(`qty`) AS `qty`
FROM `transaksi_detail` `td`
JOIN `transaksi` `t` ON `t`.`id` = `td`.`transaksi_id`
WHERE DATE(t.created_at) >= '2026-06-12'
SELECT SUM(`total_bayar`) AS `total`
FROM `transaksi`
WHERE DATE(created_at) >= '2026-06-05'
AND DATE(created_at) <= '2026-06-11'
---
        $data['rata_rata_mingguan'] = ($data['jumlah_transaksi_mingguan'] > 0) ?
            ($data['total_pendapatan_mingguan'] / $data['jumlah_transaksi_mingguan']) : 0;

        $data['item_terjual_mingguan'] = $db->table('transaksi_detail td')
            ->join('transaksi t', 't.id = td.transaksi_id')
            ->where('DATE(t.created_at) >=', $sevenDaysAgo)
            ->selectSum('qty')
            ->get()->getRow()->qty ?? 0;

        $sevenDaysBeforeEnd = date('Y-m-d', strtotime('-7 days'));
        $sevenDaysBeforeAgo = date('Y-m-d', strtotime('-13 days'));
        $totalMingguanLalu = $db->table('transaksi')
            ->selectSum('total_bayar', 'total')
            ->where('DATE(created_at) >=', $sevenDaysBeforeAgo)
            ->where('DATE(created_at) <=', $sevenDaysBeforeEnd)
            ->get()->getRow()->total ?? 0;

SELECT `penerimaan_barang`.*, `produk`.`nama_produk`, `penerimaan_detail`.`jumlah_masuk`
FROM `penerimaan_barang`
JOIN `penerimaan_detail` ON `penerimaan_detail`.`penerimaan_id` = `penerimaan_barang`.`penerimaan_id`
JOIN `produk` ON `produk`.`produk_id` = `penerimaan_detail`.`produk_id`
WHERE `penerimaan_barang`.`status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT SUM(`stok`) AS `stok`
FROM `produk`
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `stok` <= 25
AND `stok` > 0
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `stok` = 0
---

        // 5. Inventarisasi
        $penerimaanModel = new \App\Models\PenerimaanModel();
        $data['notif_pending'] = $penerimaanModel->select('penerimaan_barang.*, produk.nama_produk, penerimaan_detail.jumlah_masuk')
            ->join('penerimaan_detail', 'penerimaan_detail.penerimaan_id = penerimaan_barang.penerimaan_id')
            ->join('produk', 'produk.produk_id = penerimaan_detail.produk_id')
            ->where('penerimaan_barang.status', 'Pending')
            ->findAll();

        $data['total_produk']    = $db->table('produk')->countAllResults();
        $data['total_stok']      = $db->table('produk')->selectSum('stok')->get()->getRow()->stok ?? 0;
        $data['stok_menipis']    = $db->table('produk')->where('stok <=', 25)->where('stok >', 0)->countAllResults();
        $data['stok_habis']      = $db->table('produk')->where('stok', 0)->countAllResults();

SELECT *
FROM `produk`
WHERE `stok` <= 25
AND `stok` > 0
SELECT `p`.`produk_id`, `p`.`nama_produk`, SUM(td.qty) as total_laku
FROM `transaksi_detail` `td`
JOIN `produk` `p` ON `p`.`produk_id` = `td`.`produk_id`
GROUP BY `p`.`produk_id`, `p`.`nama_produk`
ORDER BY `total_laku` DESC
 LIMIT 5
---
        $query_inventory = $db->query("SELECT SUM(harga_beli * stok) as total FROM produk");
        $data['nilai_inventory'] = $query_inventory->getRow()->total ?? 0;

        $data['notif_menipis']   = $db->table('produk')->where('stok <=', 25)->where('stok >', 0)->get()->getResultArray();

        // 6. Data Terlaris
        $data['produk_terlaris'] = $db->table('transaksi_detail td')
            ->select('p.produk_id, p.nama_produk, SUM(td.qty) as total_laku')
            ->join('produk p', 'p.produk_id = td.produk_id')
            ->groupBy('p.produk_id, p.nama_produk')
            ->orderBy('total_laku', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT *
FROM `transaksi`
ORDER BY `created_at` DESC
 LIMIT 10
---

        $data['pie_labels'] = json_encode($labelsPie);
        $data['pie_data']   = json_encode($dataPie);
        $data['riwayat']    = $db->table('transaksi')->orderBy('created_at', 'DESC')->limit(10)->get()->getResultArray();

SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT `p`.`nama_produk`, SUM(td.qty) as total_keluar
FROM `transaksi_detail` `td`
JOIN `produk` `p` ON `p`.`produk_id` = `td`.`produk_id`
JOIN `transaksi` `t` ON `t`.`id` = `td`.`transaksi_id`
WHERE `t`.`status` = 'Lunas'
GROUP BY `td`.`produk_id`, `p`.`nama_produk`
ORDER BY `total_keluar` DESC
 LIMIT 5
SELECT `p`.`nama_produk`, `pd`.`tgl_expired`, SUM(pd.jumlah_masuk) as total_qty
FROM `penerimaan_detail` `pd`
JOIN `produk` `p` ON `p`.`produk_id` = `pd`.`produk_id`
WHERE `pd`.`tgl_expired` <= '2026-07-18'
AND `pd`.`tgl_expired` >= '2026-06-18'
GROUP BY `pd`.`produk_id`, `pd`.`tgl_expired`
ORDER BY `pd`.`tgl_expired` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `penerimaan_detail`
WHERE `tgl_expired` <= '2026-07-18'
AND `tgl_expired` >= '2026-06-18'
SELECT `metode_pembayaran`, COUNT(id) as total_penggunaan
FROM `transaksi`
WHERE `status` != 'Batal'
GROUP BY `metode_pembayaran`
ORDER BY `total_penggunaan` DESC
---

        // 8. Pengaturan (Identitas Toko/Logo)
        $modelSetting = new \App\Models\PengaturanModel();
        $data['setting'] = $modelSetting->first();

        // 9. Data Top Produk Keluar
        $data['top_produk_keluar'] = $db->table('transaksi_detail td')
            ->select('p.nama_produk, SUM(td.qty) as total_keluar')
            ->join('produk p', 'p.produk_id = td.produk_id')
            ->join('transaksi t', 't.id = td.transaksi_id')
            ->where('t.status', 'Lunas')
            ->groupBy('td.produk_id, p.nama_produk')
            ->orderBy('total_keluar', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        // 10. Data Produk Hampir Expired
        $data['produk_expired'] = $db->table('penerimaan_detail pd')
            ->select('p.nama_produk, pd.tgl_expired, SUM(pd.jumlah_masuk) as total_qty')
            ->join('produk p', 'p.produk_id = pd.produk_id')
            ->where('pd.tgl_expired <=', date('Y-m-d', strtotime('+30 days')))
            ->where('pd.tgl_expired >=', date('Y-m-d'))
            ->groupBy('pd.produk_id, pd.tgl_expired')
            ->orderBy('pd.tgl_expired', 'ASC')
            ->limit(5)
            ->get()
            ->getResultArray();

        // 11. Menghitung item yang akan expire
        $data['total_item_expired'] = $db->table('penerimaan_detail')
            ->where('tgl_expired <=', date('Y-m-d', strtotime('+30 days')))
            ->where('tgl_expired >=', date('Y-m-d'))
            ->countAllResults();

        $metode_bayar_raw = $db->table('transaksi')
            ->select('metode_pembayaran, COUNT(id) as total_penggunaan')
            ->where('status !=', 'Batal')
            ->groupBy('metode_pembayaran')
            ->orderBy('total_penggunaan', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `master_pengumuman`
WHERE `status_aktif` = 'Y'
AND `tgl_mulai` <= '2026-06-18'
AND `tgl_selesai` >= '2026-06-18'
ORDER BY `id_pengumuman` DESC
---
            $configPusat['database'] = 'db_kasir';
            $dbPusat = \Config\Database::connect($configPusat, false);

            $broadcastPusat = $dbPusat->table('master_pengumuman')
                ->where('status_aktif', 'Y')
                ->where('tgl_mulai <=', $hariIni)
                ->where('tgl_selesai >=', $hariIni)
                ->orderBy('id_pengumuman', 'DESC')
                ->get()
                ->getRowArray();

SELECT *
FROM `stok_opname`
SELECT *
FROM `produk`
SELECT *
FROM `sistem_kontrol`
WHERE `nama_fitur` = 'stok_opname_hold'
---
    public function stokopname()
    {
        // 1. Panggil Model-model yang dibutuhin
        $this->StokModel = new \App\Models\StokOpnameModel();
        $this->ProdukModel = new \App\Models\ProdukModel(); // Pastikan nama model produk sesuai

        $db = $this->db;

        // 2. Ambil semua data yang dibutuhin View
        $data = [
            'title'      => 'Stok Opname',
            'stok'       => $this->StokModel->findAll(), // Data riwayat opname
            'produk'     => $this->ProdukModel->findAll(), // <--- INI YANG TADI KURANG, BOS!
            'cek_opname' => $db->table('sistem_kontrol')->where('nama_fitur', 'stok_opname_hold')->get()->getRow(),

SELECT *
FROM `master_pengumuman`
WHERE `status_aktif` = 'Y'
AND `tgl_mulai` <= '2026-06-17'
AND `tgl_selesai` >= '2026-06-17'
ORDER BY `id_pengumuman` DESC
---
    public function cek_broadcast_realtime()
    {
        $dbConfig = config('Database');
        $hariIni  = date('Y-m-d');

        try {
            $configPusat = $dbConfig->default;
            $configPusat['database'] = 'db_kasir';
            $dbPusat = \Config\Database::connect($configPusat, false);

            $broadcastPusat = $dbPusat->table('master_pengumuman')
                ->where('status_aktif', 'Y')
                ->where('tgl_mulai <=', $hariIni)
                ->where('tgl_selesai >=', $hariIni)
                ->orderBy('id_pengumuman', 'DESC')
                ->get()
                ->getRowArray();