app/Controllers/Auth.php

    public function proses_login()
    {
        $kode_toko = trim((string)$this->request->getPost('kode_toko'));
        $username  = trim((string)$this->request->getPost('username'));
        $password  = $this->request->getPost('password');

        $toko = $this->db->table('master_toko')
            ->where('kode_toko', $kode_toko)
            ->where('status_aktif', 'Y')
            ->get()->getRow();
---
SELECT *
FROM `master_toko`
WHERE `kode_toko` = 'outlet1'
AND `status_aktif` = 'Y'

        }

        // 3. Ambil Data User Berdasarkan Username
        $user = $this->db->table('user')
            ->where('username', $username)
            ->get()->getRow();
---
SELECT *
FROM `user`
WHERE `username` = '1212'

    public function cek_status_langganan()
    {
        $this->response->setHeader('Content-Type', 'application/json');
        $this->response->setHeader('Cache-Control', 'no-cache, no-store, must-revalidate');
        $this->response->setHeader('Pragma', 'no-cache');

        $dbMaster = \Config\Database::connect();
        $dbClient = session()->get('db_client');

        if (!$dbClient) {
            return $this->response->setJSON(['status_aktif' => 'N', 'apakah_expired' => true]);
        }

        $toko = $dbMaster->table('master_toko')->where('nama_database', $dbClient)->get()->getRow();
---
SELECT *
FROM `master_toko`
WHERE `nama_database` = 'db_kasir'

    private function tambah_log($user, $role, $log_aktivitas)
    {
        $db = \Config\Database::connect();
        $dbClient = session()->get('db_client');

        if (!empty($dbClient)) {
            try {
                $db->setDatabase($dbClient);
            } catch (\Exception $e) {
                return false;
            }
        }

        $data = [
            'user'      => $user,
            'role'      => $role,
            'aktivitas' => $log_aktivitas,
            'waktu'     => date('Y-m-d H:i:s')
        ];

        $db->table('log_aktivitas')->insert($data);
---
INSERT INTO `log_aktivitas` (`user`, `role`, `aktivitas`, `waktu`) VALUES ('1212', 'admin', 'Login Berhasil ke dalam Sistem Kasir', '2026-06-18 09:13:28')