app/Controllers/Kasir.php

SELECT *
FROM `pengaturan`
WHERE `id` = 1
---
    public function index()
    {
        $db = $this->db;
        $model = new \App\Models\ProdukModel();

        // JEDOR! Pastikan Waktu Jakarta agar filter $today akurat
        date_default_timezone_set('Asia/Jakarta');
        $today  = date('Y-m-d');
        $userId = session()->get('id_user');
        $role   = session()->get('role');

        // 1. CEK SESSION LOGIN
        if (!$userId) {
            return redirect()->to(site_url('login'));
        }

        // Ambil setting (Termasuk nilai PAJAK di sini)
        $setting = $db->table('pengaturan')->where('id', 1)->get()->getRowArray();

SELECT `resep`.`id_produk_jual`, `resep`.`id_bahan_baku`, `resep`.`jumlah_kebutuhan`, `produk`.`stok` as `stok_bahan`, `produk`.`nama_produk` as `nama_bahan`
FROM `resep`
JOIN `produk` ON `resep`.`id_bahan_baku` = `produk`.`produk_id`
---
        }

        // --- 2. LOGIKA RESEP ---
        $dataResepMentah = $db->table('resep')
            ->select('resep.id_produk_jual, resep.id_bahan_baku, resep.jumlah_kebutuhan, produk.stok as stok_bahan, produk.nama_produk as nama_bahan')
            ->join('produk', 'resep.id_bahan_baku = produk.produk_id')
            ->get()->getResultArray();

SELECT `pt`.*, `m`.`nomor_meja`
FROM `pesanan_temp` `pt`
JOIN `meja` `m` ON `m`.`id_meja` = `pt`.`id_meja`
WHERE `pt`.`status_order` = 'Pending'
ORDER BY `pt`.`created_at` DESC
SELECT `pt`.`id_temp`, `pt`.`produk_id`, `pt`.`jumlah`, `p`.`nama_produk`, `p`.`harga_jual`
FROM `penjualan_temp` `pt`
JOIN `produk` `p` ON `p`.`produk_id` = `pt`.`produk_id`
WHERE `pt`.`id_user` = '1'
SELECT *
FROM `produk`
WHERE `jenis_stok` IN ('Kering','Basah')
SELECT *
FROM `shift_kasir`
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `pengeluaran_harian`
WHERE `tanggal` = '2026-06-18'
---
        $rekap = $builder->get()->getRowArray();

        // --- 4. DATA ANTREAN MEJA ---
        $antrean = $db->table('pesanan_temp pt')
            ->select('pt.*, m.nomor_meja')
            ->join('meja m', 'm.id_meja = pt.id_meja')
            ->where('pt.status_order', 'Pending')
            ->orderBy('pt.created_at', 'DESC')
            ->get()->getResultArray();

        // --- 5. SINKRONISASI KERANJANG ---
        $keranjangDb = $db->table('penjualan_temp pt')
            ->select('pt.id_temp, pt.produk_id, pt.jumlah, p.nama_produk, p.harga_jual')
            ->join('produk p', 'p.produk_id = pt.produk_id')
            ->where('pt.id_user', $userId)
            ->get()->getResultArray();


        // --- 6. PREPARASI DATA VIEW (Lengkap dengan data pajak dari $setting) ---
        $data = [
            'produk'            => $model->whereIn('jenis_stok', ['Kering', 'Basah'])->findAll(),
            'list_id_resep'     => $listIdResep,
            'data_resep'        => $resepMapped,
            'rekap'             => $rekap,
            'today'             => $today,
            'shift'             => $cekShift,
            'setting'           => $setting, // <--- Ini yang bawa data PAJAK ke View Kasir
            'master_shift'      => $db->table('shift_kasir')->get()->getResultArray(),
            'nama_user'         => session()->get('nama_user'),
            'role'              => $role,
            'antrean_meja'      => $antrean,
            'jumlah_antrean'    => count($antrean),
            'cart_database'     => $keranjangDb,
            'total_pengeluaran' => $db->table('pengeluaran_harian')->selectSum('total_bayar')->where('tanggal', $today)->get()->getRow()->total_bayar ?? 0,
            'title'             => "Kasir"
        ];