app/Views/kasir/kasir_view.php

SELECT *
FROM `sistem_kontrol`
WHERE `nama_fitur` = 'stok_opname_hold'
---

                <?php
                $db = \Config\Database::connect();
                $cek_opname = $db->table('sistem_kontrol')
                    ->where('nama_fitur', 'stok_opname_hold')
                    ->get()->getRow();